zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the Flash API.
//
//*****************************************************************************
#ifdef ROM_FlashCtl_enableReadParityCheck
#define MAP_FlashCtl_enableReadParityCheck                                    \
        ROM_FlashCtl_enableReadParityCheck
#else
#define MAP_FlashCtl_enableReadParityCheck                                    \
        FlashCtl_enableReadParityCheck
#endif
#ifdef ROM_FlashCtl_disableReadParityCheck
#define MAP_FlashCtl_disableReadParityCheck                                   \
        ROM_FlashCtl_disableReadParityCheck
#else
#define MAP_FlashCtl_disableReadParityCheck                                   \
        FlashCtl_disableReadParityCheck
#endif
#ifdef ROM_FlashCtl_enableReadBuffering
#define MAP_FlashCtl_enableReadBuffering                                      \
        ROM_FlashCtl_enableReadBuffering
#else
#define MAP_FlashCtl_enableReadBuffering                                      \
        FlashCtl_enableReadBuffering
#endif
#ifdef ROM_FlashCtl_disableReadBuffering
#define MAP_FlashCtl_disableReadBuffering                                     \
        ROM_FlashCtl_disableReadBuffering
#else
#define MAP_FlashCtl_disableReadBuffering                                     \
        FlashCtl_disableReadBuffering
#endif
#ifdef ROM_FlashCtl_unprotectSector
#define MAP_FlashCtl_unprotectSector                                          \
        ROM_FlashCtl_unprotectSector
#else
#define MAP_FlashCtl_unprotectSector                                          \
        FlashCtl_unprotectSector
#endif
#ifdef ROM_FlashCtl_protectSector
#define MAP_FlashCtl_protectSector                                            \
        ROM_FlashCtl_protectSector
#else
#define MAP_FlashCtl_protectSector                                            \
        FlashCtl_protectSector
#endif
#ifdef ROM_FlashCtl_isSectorProtected
#define MAP_FlashCtl_isSectorProtected                                        \
        ROM_FlashCtl_isSectorProtected
#else
#define MAP_FlashCtl_isSectorProtected                                        \
        FlashCtl_isSectorProtected
#endif
#ifdef ROM_FlashCtl_verifyMemory
#define MAP_FlashCtl_verifyMemory                                             \
        ROM_FlashCtl_verifyMemory
#else
#define MAP_FlashCtl_verifyMemory                                             \
        FlashCtl_verifyMemory
#endif
#ifdef ROM_FlashCtl_performMassErase
#define MAP_FlashCtl_performMassErase                                         \
        ROM_FlashCtl_performMassErase
#else
#define MAP_FlashCtl_performMassErase                                         \
        FlashCtl_performMassErase
#endif
#ifdef ROM_FlashCtl_eraseSector
#define MAP_FlashCtl_eraseSector                                              \
        ROM_FlashCtl_eraseSector
#else
#define MAP_FlashCtl_eraseSector                                              \
        FlashCtl_eraseSector
#endif
#ifdef ROM_FlashCtl_programMemory
#define MAP_FlashCtl_programMemory                                            \
        ROM_FlashCtl_programMemory
#else
#define MAP_FlashCtl_programMemory                                            \
        FlashCtl_programMemory
#endif
#ifdef ROM_FlashCtl_setProgramVerification
#define MAP_FlashCtl_setProgramVerification                                   \
        ROM_FlashCtl_setProgramVerification
#else
#define MAP_FlashCtl_setProgramVerification                                   \
        FlashCtl_setProgramVerification
#endif
#ifdef ROM_FlashCtl_clearProgramVerification
#define MAP_FlashCtl_clearProgramVerification                                 \
        ROM_FlashCtl_clearProgramVerification
#else
#define MAP_FlashCtl_clearProgramVerification                                 \
        FlashCtl_clearProgramVerification
#endif
#ifdef ROM_FlashCtl_enableWordProgramming
#define MAP_FlashCtl_enableWordProgramming                                    \
        ROM_FlashCtl_enableWordProgramming
#else
#define MAP_FlashCtl_enableWordProgramming                                    \
        FlashCtl_enableWordProgramming
#endif
#ifdef ROM_FlashCtl_disableWordProgramming
#define MAP_FlashCtl_disableWordProgramming                                   \
        ROM_FlashCtl_disableWordProgramming
#else
#define MAP_FlashCtl_disableWordProgramming                                   \
        FlashCtl_disableWordProgramming
#endif
#ifdef ROM_FlashCtl_isWordProgrammingEnabled
#define MAP_FlashCtl_isWordProgrammingEnabled                                 \
        ROM_FlashCtl_isWordProgrammingEnabled
#else
#define MAP_FlashCtl_isWordProgrammingEnabled                                 \
        FlashCtl_isWordProgrammingEnabled
#endif
#ifdef ROM_FlashCtl_enableInterrupt
#define MAP_FlashCtl_enableInterrupt                                          \
        ROM_FlashCtl_enableInterrupt
#else
#define MAP_FlashCtl_enableInterrupt                                          \
        FlashCtl_enableInterrupt
#endif
#ifdef ROM_FlashCtl_disableInterrupt
#define MAP_FlashCtl_disableInterrupt                                         \
        ROM_FlashCtl_disableInterrupt
#else
#define MAP_FlashCtl_disableInterrupt                                         \
        FlashCtl_disableInterrupt
#endif
#ifdef ROM_FlashCtl_getEnabledInterruptStatus
#define MAP_FlashCtl_getEnabledInterruptStatus                                \
        ROM_FlashCtl_getEnabledInterruptStatus
#else
#define MAP_FlashCtl_getEnabledInterruptStatus                                \
        FlashCtl_getEnabledInterruptStatus
#endif
#ifdef ROM_FlashCtl_getInterruptStatus
#define MAP_FlashCtl_getInterruptStatus                                       \
        ROM_FlashCtl_getInterruptStatus
#else
#define MAP_FlashCtl_getInterruptStatus                                       \
        FlashCtl_getInterruptStatus
#endif
#ifdef ROM_FlashCtl_clearInterruptFlag
#define MAP_FlashCtl_clearInterruptFlag                                       \
        ROM_FlashCtl_clearInterruptFlag
#else
#define MAP_FlashCtl_clearInterruptFlag                                       \
        FlashCtl_clearInterruptFlag
#endif
#ifdef ROM_FlashCtl_setWaitState
#define MAP_FlashCtl_setWaitState                                             \
        ROM_FlashCtl_setWaitState
#else
#define MAP_FlashCtl_setWaitState                                             \
        FlashCtl_setWaitState
#endif
#ifdef ROM_FlashCtl_getWaitState
#define MAP_FlashCtl_getWaitState                                             \
        ROM_FlashCtl_getWaitState
#else
#define MAP_FlashCtl_getWaitState                                             \
        FlashCtl_getWaitState
#endif
#ifdef ROM_FlashCtl_setReadMode
#define MAP_FlashCtl_setReadMode                                              \
        ROM_FlashCtl_setReadMode
#else
#define MAP_FlashCtl_setReadMode                                              \
        FlashCtl_setReadMode
#endif
#ifdef ROM_FlashCtl_getReadMode
#define MAP_FlashCtl_getReadMode                                              \
        ROM_FlashCtl_getReadMode
#else
#define MAP_FlashCtl_getReadMode                                              \
        FlashCtl_getReadMode
#endif
#ifdef ROM_FlashCtl_registerInterrupt
#define MAP_FlashCtl_registerInterrupt                                        \
        ROM_FlashCtl_registerInterrupt
#else
#define MAP_FlashCtl_registerInterrupt                                        \
        FlashCtl_registerInterrupt
#endif
#ifdef ROM_FlashCtl_unregisterInterrupt
#define MAP_FlashCtl_unregisterInterrupt                                      \
        ROM_FlashCtl_unregisterInterrupt
#else
#define MAP_FlashCtl_unregisterInterrupt                                      \
        FlashCtl_unregisterInterrupt
#endif
#ifdef ROM___FlashCtl_remaskData8Post
#define MAP___FlashCtl_remaskData8Post                                        \
        ROM___FlashCtl_remaskData8Post
#else
#define MAP___FlashCtl_remaskData8Post                                        \
        __FlashCtl_remaskData8Post
#endif
#ifdef ROM___FlashCtl_remaskData8Pre
#define MAP___FlashCtl_remaskData8Pre                                         \
        ROM___FlashCtl_remaskData8Pre
#else
#define MAP___FlashCtl_remaskData8Pre                                         \
        __FlashCtl_remaskData8Pre
#endif
#ifdef ROM___FlashCtl_remaskData32Pre
#define MAP___FlashCtl_remaskData32Pre                                        \
        ROM___FlashCtl_remaskData32Pre
#else
#define MAP___FlashCtl_remaskData32Pre                                        \
        __FlashCtl_remaskData32Pre
#endif
#ifdef ROM___FlashCtl_remaskData32Post
#define MAP___FlashCtl_remaskData32Post                                       \
        ROM___FlashCtl_remaskData32Post
#else
#define MAP___FlashCtl_remaskData32Post                                       \
        __FlashCtl_remaskData32Post
#endif
#ifdef ROM___FlashCtl_remaskBurstDataPre
#define MAP___FlashCtl_remaskBurstDataPre                                     \
        ROM___FlashCtl_remaskBurstDataPre
#else
#define MAP___FlashCtl_remaskBurstDataPre                                     \
        __FlashCtl_remaskBurstDataPre
#endif
#ifdef ROM___FlashCtl_remaskBurstDataPost
#define MAP___FlashCtl_remaskBurstDataPost                                    \
        ROM___FlashCtl_remaskBurstDataPost
#else
#define MAP___FlashCtl_remaskBurstDataPost                                    \
        __FlashCtl_remaskBurstDataPost
#endif
#ifdef ROM_FlashCtl_initiateSectorErase
#define MAP_FlashCtl_initiateSectorErase                                      \
        ROM_FlashCtl_initiateSectorErase
#else
#define MAP_FlashCtl_initiateSectorErase                                      \
        FlashCtl_initiateSectorErase
#endif
#ifdef ROM_FlashCtl_initiateMassErase
#define MAP_FlashCtl_initiateMassErase                                        \
        ROM_FlashCtl_initiateMassErase
#else
#define MAP_FlashCtl_initiateMassErase                                        \
        FlashCtl_initiateMassErase
#endif
#ifdef ROM_FlashCtl_getMemoryInfo
#define MAP_FlashCtl_getMemoryInfo                                            \
        ROM_FlashCtl_getMemoryInfo
#else
#define MAP_FlashCtl_getMemoryInfo                                            \
        FlashCtl_getMemoryInfo
#endif

//*****************************************************************************
//
// Macros for the FPU API.
//
//*****************************************************************************
#ifdef ROM_FPU_enableModule
#define MAP_FPU_enableModule                                                  \
        ROM_FPU_enableModule
#else
#define MAP_FPU_enableModule                                                  \
        FPU_enableModule
#endif
#ifdef ROM_FPU_disableModule
#define MAP_FPU_disableModule                                                 \
        ROM_FPU_disableModule
#else
#define MAP_FPU_disableModule                                                 \
        FPU_disableModule
#endif
#ifdef ROM_FPU_enableStacking
#define MAP_FPU_enableStacking                                                \
        ROM_FPU_enableStacking
#else
#define MAP_FPU_enableStacking                                                \
        FPU_enableStacking
#endif
#ifdef ROM_FPU_enableLazyStacking
#define MAP_FPU_enableLazyStacking                                            \
        ROM_FPU_enableLazyStacking
#else
#define MAP_FPU_enableLazyStacking                                            \
        FPU_enableLazyStacking
#endif
#ifdef ROM_FPU_disableStacking
#define MAP_FPU_disableStacking                                               \
        ROM_FPU_disableStacking
#else
#define MAP_FPU_disableStacking                                               \
        FPU_disableStacking
#endif
#ifdef ROM_FPU_setHalfPrecisionMode
#define MAP_FPU_setHalfPrecisionMode                                          \
        ROM_FPU_setHalfPrecisionMode
#else
#define MAP_FPU_setHalfPrecisionMode                                          \
        FPU_setHalfPrecisionMode
#endif
#ifdef ROM_FPU_setNaNMode
#define MAP_FPU_setNaNMode                                                    \
        ROM_FPU_setNaNMode
#else
#define MAP_FPU_setNaNMode                                                    \
        FPU_setNaNMode
#endif
#ifdef ROM_FPU_setFlushToZeroMode
#define MAP_FPU_setFlushToZeroMode                                            \
        ROM_FPU_setFlushToZeroMode
#else
#define MAP_FPU_setFlushToZeroMode                                            \
        FPU_setFlushToZeroMode
#endif
#ifdef ROM_FPU_setRoundingMode
#define MAP_FPU_setRoundingMode                                               \
        ROM_FPU_setRoundingMode
#else
#define MAP_FPU_setRoundingMode                                               \
        FPU_setRoundingMode
#endif

//*****************************************************************************
//
// Macros for the GPIO API.
//
//*****************************************************************************
#ifdef ROM_GPIO_setAsOutputPin
#define MAP_GPIO_setAsOutputPin                                               \
        ROM_GPIO_setAsOutputPin
#else
#define MAP_GPIO_setAsOutputPin                                               \
        GPIO_setAsOutputPin
#endif
#ifdef ROM_GPIO_setOutputHighOnPin
#define MAP_GPIO_setOutputHighOnPin                                           \
        ROM_GPIO_setOutputHighOnPin
#else
#define MAP_GPIO_setOutputHighOnPin                                           \
        GPIO_setOutputHighOnPin
#endif
#ifdef ROM_GPIO_setOutputLowOnPin
#define MAP_GPIO_setOutputLowOnPin                                            \
        ROM_GPIO_setOutputLowOnPin
#else
#define MAP_GPIO_setOutputLowOnPin                                            \
        GPIO_setOutputLowOnPin
#endif
#ifdef ROM_GPIO_toggleOutputOnPin
#define MAP_GPIO_toggleOutputOnPin                                            \
        ROM_GPIO_toggleOutputOnPin
#else
#define MAP_GPIO_toggleOutputOnPin                                            \
        GPIO_toggleOutputOnPin
#endif
#ifdef ROM_GPIO_setAsInputPinWithPullDownResistor
#define MAP_GPIO_setAsInputPinWithPullDownResistor                            \
        ROM_GPIO_setAsInputPinWithPullDownResistor
#else
#define MAP_GPIO_setAsInputPinWithPullDownResistor                            \
        GPIO_setAsInputPinWithPullDownResistor
#endif
#ifdef ROM_GPIO_setAsInputPinWithPullUpResistor
#define MAP_GPIO_setAsInputPinWithPullUpResistor                              \
        ROM_GPIO_setAsInputPinWithPullUpResistor
#else
#define MAP_GPIO_setAsInputPinWithPullUpResistor                              \
        GPIO_setAsInputPinWithPullUpResistor
#endif
#ifdef ROM_GPIO_setAsPeripheralModuleFunctionOutputPin
#define MAP_GPIO_setAsPeripheralModuleFunctionOutputPin                       \
        ROM_GPIO_setAsPeripheralModuleFunctionOutputPin
#else
#define MAP_GPIO_setAsPeripheralModuleFunctionOutputPin                       \
        GPIO_setAsPeripheralModuleFunctionOutputPin
#endif
#ifdef ROM_GPIO_setAsPeripheralModuleFunctionInputPin
#define MAP_GPIO_setAsPeripheralModuleFunctionInputPin                        \
        ROM_GPIO_setAsPeripheralModuleFunctionInputPin
#else
#define MAP_GPIO_setAsPeripheralModuleFunctionInputPin                        \
        GPIO_setAsPeripheralModuleFunctionInputPin
#endif
#ifdef ROM_GPIO_getInputPinValue
#define MAP_GPIO_getInputPinValue                                             \
        ROM_GPIO_getInputPinValue
#else
#define MAP_GPIO_getInputPinValue                                             \
        GPIO_getInputPinValue
#endif
#ifdef ROM_GPIO_interruptEdgeSelect
#define MAP_GPIO_interruptEdgeSelect                                          \
        ROM_GPIO_interruptEdgeSelect
#else
#define MAP_GPIO_interruptEdgeSelect                                          \
        GPIO_interruptEdgeSelect
#endif
#ifdef ROM_GPIO_enableInterrupt
#define MAP_GPIO_enableInterrupt                                              \
        ROM_GPIO_enableInterrupt
#else
#define MAP_GPIO_enableInterrupt                                              \
        GPIO_enableInterrupt
#endif
#ifdef ROM_GPIO_disableInterrupt
#define MAP_GPIO_disableInterrupt                                             \
        ROM_GPIO_disableInterrupt
#else
#define MAP_GPIO_disableInterrupt                                             \
        GPIO_disableInterrupt
#endif
#ifdef ROM_GPIO_getInterruptStatus
#define MAP_GPIO_getInterruptStatus                                           \
        ROM_GPIO_getInterruptStatus
#else
#define MAP_GPIO_getInterruptStatus                                           \
        GPIO_getInterruptStatus
#endif
#ifdef ROM_GPIO_clearInterruptFlag
#define MAP_GPIO_clearInterruptFlag                                           \
        ROM_GPIO_clearInterruptFlag
#else
#define MAP_GPIO_clearInterruptFlag                                           \
        GPIO_clearInterruptFlag
#endif
#ifdef ROM_GPIO_setAsInputPin
#define MAP_GPIO_setAsInputPin                                                \
        ROM_GPIO_setAsInputPin
#else
#define MAP_GPIO_setAsInputPin                                                \
        GPIO_setAsInputPin
#endif
#ifdef ROM_GPIO_getEnabledInterruptStatus
#define MAP_GPIO_getEnabledInterruptStatus                                    \
        ROM_GPIO_getEnabledInterruptStatus
#else
#define MAP_GPIO_getEnabledInterruptStatus                                    \
        GPIO_getEnabledInterruptStatus
#endif
#ifdef ROM_GPIO_setDriveStrengthHigh
#define MAP_GPIO_setDriveStrengthHigh                                         \
        ROM_GPIO_setDriveStrengthHigh
#else
#define MAP_GPIO_setDriveStrengthHigh                                         \
        GPIO_setDriveStrengthHigh
#endif
#ifdef ROM_GPIO_setDriveStrengthLow
#define MAP_GPIO_setDriveStrengthLow                                          \
        ROM_GPIO_setDriveStrengthLow
#else
#define MAP_GPIO_setDriveStrengthLow                                          \
        GPIO_setDriveStrengthLow
#endif
#ifdef ROM_GPIO_registerInterrupt
#define MAP_GPIO_registerInterrupt                                            \
        ROM_GPIO_registerInterrupt
#else
#define MAP_GPIO_registerInterrupt                                            \
        GPIO_registerInterrupt
#endif
#ifdef ROM_GPIO_unregisterInterrupt
#define MAP_GPIO_unregisterInterrupt                                          \
        ROM_GPIO_unregisterInterrupt
#else
#define MAP_GPIO_unregisterInterrupt                                          \
        GPIO_unregisterInterrupt
#endif

