zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the SysCtl_A API.
//
//*****************************************************************************
#ifdef ROM_SysCtl_A_getSRAMSize
#define MAP_SysCtl_A_getSRAMSize                                              \
        ROM_SysCtl_A_getSRAMSize
#else
#define MAP_SysCtl_A_getSRAMSize                                              \
        SysCtl_A_getSRAMSize
#endif
#ifdef ROM_SysCtl_A_getFlashSize
#define MAP_SysCtl_A_getFlashSize                                             \
        ROM_SysCtl_A_getFlashSize
#else
#define MAP_SysCtl_A_getFlashSize                                             \
        SysCtl_A_getFlashSize
#endif
#ifdef ROM_SysCtl_A_rebootDevice
#define MAP_SysCtl_A_rebootDevice                                             \
        ROM_SysCtl_A_rebootDevice
#else
#define MAP_SysCtl_A_rebootDevice                                             \
        SysCtl_A_rebootDevice
#endif
#ifdef ROM_SysCtl_A_enableSRAM
#define MAP_SysCtl_A_enableSRAM                                               \
        ROM_SysCtl_A_enableSRAM
#else
#define MAP_SysCtl_A_enableSRAM                                               \
        SysCtl_A_enableSRAM
#endif
#ifdef ROM_SysCtl_A_disableSRAM
#define MAP_SysCtl_A_disableSRAM                                              \
        ROM_SysCtl_A_disableSRAM
#else
#define MAP_SysCtl_A_disableSRAM                                              \
        SysCtl_A_disableSRAM
#endif
#ifdef ROM_SysCtl_A_enableSRAMRetention
#define MAP_SysCtl_A_enableSRAMRetention                                      \
        ROM_SysCtl_A_enableSRAMRetention
#else
#define MAP_SysCtl_A_enableSRAMRetention                                      \
        SysCtl_A_enableSRAMRetention
#endif
#ifdef ROM_SysCtl_A_disableSRAMRetention
#define MAP_SysCtl_A_disableSRAMRetention                                     \
        ROM_SysCtl_A_disableSRAMRetention
#else
#define MAP_SysCtl_A_disableSRAMRetention                                     \
        SysCtl_A_disableSRAMRetention
#endif
#ifdef ROM_SysCtl_A_enablePeripheralAtCPUHalt
#define MAP_SysCtl_A_enablePeripheralAtCPUHalt                                \
        ROM_SysCtl_A_enablePeripheralAtCPUHalt
#else
#define MAP_SysCtl_A_enablePeripheralAtCPUHalt                                \
        SysCtl_A_enablePeripheralAtCPUHalt
#endif
#ifdef ROM_SysCtl_A_disablePeripheralAtCPUHalt
#define MAP_SysCtl_A_disablePeripheralAtCPUHalt                               \
        ROM_SysCtl_A_disablePeripheralAtCPUHalt
#else
#define MAP_SysCtl_A_disablePeripheralAtCPUHalt                               \
        SysCtl_A_disablePeripheralAtCPUHalt
#endif
#ifdef ROM_SysCtl_A_setWDTTimeoutResetType
#define MAP_SysCtl_A_setWDTTimeoutResetType                                   \
        ROM_SysCtl_A_setWDTTimeoutResetType
#else
#define MAP_SysCtl_A_setWDTTimeoutResetType                                   \
        SysCtl_A_setWDTTimeoutResetType
#endif
#ifdef ROM_SysCtl_A_setWDTPasswordViolationResetType
#define MAP_SysCtl_A_setWDTPasswordViolationResetType                         \
        ROM_SysCtl_A_setWDTPasswordViolationResetType
#else
#define MAP_SysCtl_A_setWDTPasswordViolationResetType                         \
        SysCtl_A_setWDTPasswordViolationResetType
#endif
#ifdef ROM_SysCtl_A_disableNMISource
#define MAP_SysCtl_A_disableNMISource                                         \
        ROM_SysCtl_A_disableNMISource
#else
#define MAP_SysCtl_A_disableNMISource                                         \
        SysCtl_A_disableNMISource
#endif
#ifdef ROM_SysCtl_A_enableNMISource
#define MAP_SysCtl_A_enableNMISource                                          \
        ROM_SysCtl_A_enableNMISource
#else
#define MAP_SysCtl_A_enableNMISource                                          \
        SysCtl_A_enableNMISource
#endif
#ifdef ROM_SysCtl_A_getNMISourceStatus
#define MAP_SysCtl_A_getNMISourceStatus                                       \
        ROM_SysCtl_A_getNMISourceStatus
#else
#define MAP_SysCtl_A_getNMISourceStatus                                       \
        SysCtl_A_getNMISourceStatus
#endif
#ifdef ROM_SysCtl_A_getTempCalibrationConstant
#define MAP_SysCtl_A_getTempCalibrationConstant                               \
        ROM_SysCtl_A_getTempCalibrationConstant
#else
#define MAP_SysCtl_A_getTempCalibrationConstant                               \
        SysCtl_A_getTempCalibrationConstant
#endif
#ifdef ROM_SysCtl_A_enableGlitchFilter
#define MAP_SysCtl_A_enableGlitchFilter                                       \
        ROM_SysCtl_A_enableGlitchFilter
#else
#define MAP_SysCtl_A_enableGlitchFilter                                       \
        SysCtl_A_enableGlitchFilter
#endif
#ifdef ROM_SysCtl_A_disableGlitchFilter
#define MAP_SysCtl_A_disableGlitchFilter                                      \
        ROM_SysCtl_A_disableGlitchFilter
#else
#define MAP_SysCtl_A_disableGlitchFilter                                      \
        SysCtl_A_disableGlitchFilter
#endif
#ifdef ROM_SysCtl_A_getTLVInfo
#define MAP_SysCtl_A_getTLVInfo                                               \
        ROM_SysCtl_A_getTLVInfo
#else
#define MAP_SysCtl_A_getTLVInfo                                               \
        SysCtl_A_getTLVInfo
#endif
#ifdef ROM_SysCtl_A_getInfoFlashSize
#define MAP_SysCtl_A_getInfoFlashSize                                         \
        ROM_SysCtl_A_getInfoFlashSize
#else
#define MAP_SysCtl_A_getInfoFlashSize                                         \
        SysCtl_A_getInfoFlashSize
#endif

//*****************************************************************************
//
// Macros for the Flash_A API.
//
//*****************************************************************************
#ifdef ROM_FlashCtl_A_enableReadParityCheck
#define MAP_FlashCtl_A_enableReadParityCheck                                  \
        ROM_FlashCtl_A_enableReadParityCheck
#else
#define MAP_FlashCtl_A_enableReadParityCheck                                  \
        FlashCtl_A_enableReadParityCheck
#endif
#ifdef ROM_FlashCtl_A_disableReadParityCheck
#define MAP_FlashCtl_A_disableReadParityCheck                                 \
        ROM_FlashCtl_A_disableReadParityCheck
#else
#define MAP_FlashCtl_A_disableReadParityCheck                                 \
        FlashCtl_A_disableReadParityCheck
#endif
#ifdef ROM_FlashCtl_A_enableReadBuffering
#define MAP_FlashCtl_A_enableReadBuffering                                    \
        ROM_FlashCtl_A_enableReadBuffering
#else
#define MAP_FlashCtl_A_enableReadBuffering                                    \
        FlashCtl_A_enableReadBuffering
#endif
#ifdef ROM_FlashCtl_A_disableReadBuffering
#define MAP_FlashCtl_A_disableReadBuffering                                   \
        ROM_FlashCtl_A_disableReadBuffering
#else
#define MAP_FlashCtl_A_disableReadBuffering                                   \
        FlashCtl_A_disableReadBuffering
#endif
#ifdef ROM_FlashCtl_A_unprotectMemory
#define MAP_FlashCtl_A_unprotectMemory                                        \
        ROM_FlashCtl_A_unprotectMemory
#else
#define MAP_FlashCtl_A_unprotectMemory                                        \
        FlashCtl_A_unprotectMemory
#endif
#ifdef ROM_FlashCtl_A_protectMemory
#define MAP_FlashCtl_A_protectMemory                                          \
        ROM_FlashCtl_A_protectMemory
#else
#define MAP_FlashCtl_A_protectMemory                                          \
        FlashCtl_A_protectMemory
#endif
#ifdef ROM_FlashCtl_A_isMemoryRangeProtected
#define MAP_FlashCtl_A_isMemoryRangeProtected                                 \
        ROM_FlashCtl_A_isMemoryRangeProtected
#else
#define MAP_FlashCtl_A_isMemoryRangeProtected                                 \
        FlashCtl_A_isMemoryRangeProtected
#endif
#ifdef ROM_FlashCtl_A_verifyMemory
#define MAP_FlashCtl_A_verifyMemory                                           \
        ROM_FlashCtl_A_verifyMemory
#else
#define MAP_FlashCtl_A_verifyMemory                                           \
        FlashCtl_A_verifyMemory
#endif
#ifdef ROM_FlashCtl_A_performMassErase
#define MAP_FlashCtl_A_performMassErase                                       \
        ROM_FlashCtl_A_performMassErase
#else
#define MAP_FlashCtl_A_performMassErase                                       \
        FlashCtl_A_performMassErase
#endif
#ifdef ROM_FlashCtl_A_eraseSector
#define MAP_FlashCtl_A_eraseSector                                            \
        ROM_FlashCtl_A_eraseSector
#else
#define MAP_FlashCtl_A_eraseSector                                            \
        FlashCtl_A_eraseSector
#endif
#ifdef ROM_FlashCtl_A_programMemory
#define MAP_FlashCtl_A_programMemory                                          \
        ROM_FlashCtl_A_programMemory
#else
#define MAP_FlashCtl_A_programMemory                                          \
        FlashCtl_A_programMemory
#endif
#ifdef ROM_FlashCtl_A_setProgramVerification
#define MAP_FlashCtl_A_setProgramVerification                                 \
        ROM_FlashCtl_A_setProgramVerification
#else
#define MAP_FlashCtl_A_setProgramVerification                                 \
        FlashCtl_A_setProgramVerification
#endif
#ifdef ROM_FlashCtl_A_clearProgramVerification
#define MAP_FlashCtl_A_clearProgramVerification                               \
        ROM_FlashCtl_A_clearProgramVerification
#else
#define MAP_FlashCtl_A_clearProgramVerification                               \
        FlashCtl_A_clearProgramVerification
#endif
#ifdef ROM_FlashCtl_A_enableWordProgramming
#define MAP_FlashCtl_A_enableWordProgramming                                  \
        ROM_FlashCtl_A_enableWordProgramming
#else
#define MAP_FlashCtl_A_enableWordProgramming                                  \
        FlashCtl_A_enableWordProgramming
#endif
#ifdef ROM_FlashCtl_A_disableWordProgramming
#define MAP_FlashCtl_A_disableWordProgramming                                 \
        ROM_FlashCtl_A_disableWordProgramming
#else
#define MAP_FlashCtl_A_disableWordProgramming                                 \
        FlashCtl_A_disableWordProgramming
#endif
#ifdef ROM_FlashCtl_A_isWordProgrammingEnabled
#define MAP_FlashCtl_A_isWordProgrammingEnabled                               \
        ROM_FlashCtl_A_isWordProgrammingEnabled
#else
#define MAP_FlashCtl_A_isWordProgrammingEnabled                               \
        FlashCtl_A_isWordProgrammingEnabled
#endif
#ifdef ROM_FlashCtl_A_enableInterrupt
#define MAP_FlashCtl_A_enableInterrupt                                        \
        ROM_FlashCtl_A_enableInterrupt
#else
#define MAP_FlashCtl_A_enableInterrupt                                        \
        FlashCtl_A_enableInterrupt
#endif
#ifdef ROM_FlashCtl_A_disableInterrupt
#define MAP_FlashCtl_A_disableInterrupt                                       \
        ROM_FlashCtl_A_disableInterrupt
#else
#define MAP_FlashCtl_A_disableInterrupt                                       \
        FlashCtl_A_disableInterrupt
#endif
#ifdef ROM_FlashCtl_A_getEnabledInterruptStatus
#define MAP_FlashCtl_A_getEnabledInterruptStatus                              \
        ROM_FlashCtl_A_getEnabledInterruptStatus
#else
#define MAP_FlashCtl_A_getEnabledInterruptStatus                              \
        FlashCtl_A_getEnabledInterruptStatus
#endif
#ifdef ROM_FlashCtl_A_getInterruptStatus
#define MAP_FlashCtl_A_getInterruptStatus                                     \
        ROM_FlashCtl_A_getInterruptStatus
#else
#define MAP_FlashCtl_A_getInterruptStatus                                     \
        FlashCtl_A_getInterruptStatus
#endif
#ifdef ROM_FlashCtl_A_clearInterruptFlag
#define MAP_FlashCtl_A_clearInterruptFlag                                     \
        ROM_FlashCtl_A_clearInterruptFlag
#else
#define MAP_FlashCtl_A_clearInterruptFlag                                     \
        FlashCtl_A_clearInterruptFlag
#endif
#ifdef ROM_FlashCtl_A_setWaitState
#define MAP_FlashCtl_A_setWaitState                                           \
        ROM_FlashCtl_A_setWaitState
#else
#define MAP_FlashCtl_A_setWaitState                                           \
        FlashCtl_A_setWaitState
#endif
#ifdef ROM_FlashCtl_A_getWaitState
#define MAP_FlashCtl_A_getWaitState                                           \
        ROM_FlashCtl_A_getWaitState
#else
#define MAP_FlashCtl_A_getWaitState                                           \
        FlashCtl_A_getWaitState
#endif
#ifdef ROM_FlashCtl_A_setReadMode
#define MAP_FlashCtl_A_setReadMode                                            \
        ROM_FlashCtl_A_setReadMode
#else
#define MAP_FlashCtl_A_setReadMode                                            \
        FlashCtl_A_setReadMode
#endif
#ifdef ROM_FlashCtl_A_getReadMode
#define MAP_FlashCtl_A_getReadMode                                            \
        ROM_FlashCtl_A_getReadMode
#else
#define MAP_FlashCtl_A_getReadMode                                            \
        FlashCtl_A_getReadMode
#endif
#ifdef ROM_FlashCtl_A_registerInterrupt
#define MAP_FlashCtl_A_registerInterrupt                                      \
        ROM_FlashCtl_A_registerInterrupt
#else
#define MAP_FlashCtl_A_registerInterrupt                                      \
        FlashCtl_A_registerInterrupt
#endif
#ifdef ROM_FlashCtl_A_unregisterInterrupt
#define MAP_FlashCtl_A_unregisterInterrupt                                    \
        ROM_FlashCtl_A_unregisterInterrupt
#else
#define MAP_FlashCtl_A_unregisterInterrupt                                    \
        FlashCtl_A_unregisterInterrupt
#endif
#ifdef ROM___FlashCtl_A_remaskData8Post
#define MAP___FlashCtl_A_remaskData8Post                                      \
        ROM___FlashCtl_A_remaskData8Post
#else
#define MAP___FlashCtl_A_remaskData8Post                                      \
        __FlashCtl_A_remaskData8Post
#endif
#ifdef ROM___FlashCtl_A_remaskData8Pre
#define MAP___FlashCtl_A_remaskData8Pre                                       \
        ROM___FlashCtl_A_remaskData8Pre
#else
#define MAP___FlashCtl_A_remaskData8Pre                                       \
        __FlashCtl_A_remaskData8Pre
#endif
#ifdef ROM___FlashCtl_A_remaskData32Pre
#define MAP___FlashCtl_A_remaskData32Pre                                      \
        ROM___FlashCtl_A_remaskData32Pre
#else
#define MAP___FlashCtl_A_remaskData32Pre                                      \
        __FlashCtl_A_remaskData32Pre
#endif
#ifdef ROM___FlashCtl_A_remaskData32Post
#define MAP___FlashCtl_A_remaskData32Post                                     \
        ROM___FlashCtl_A_remaskData32Post
#else
#define MAP___FlashCtl_A_remaskData32Post                                     \
        __FlashCtl_A_remaskData32Post
#endif
#ifdef ROM___FlashCtl_A_remaskBurstDataPre
#define MAP___FlashCtl_A_remaskBurstDataPre                                   \
        ROM___FlashCtl_A_remaskBurstDataPre
#else
#define MAP___FlashCtl_A_remaskBurstDataPre                                   \
        __FlashCtl_A_remaskBurstDataPre
#endif
#ifdef ROM___FlashCtl_A_remaskBurstDataPost
#define MAP___FlashCtl_A_remaskBurstDataPost                                  \
        ROM___FlashCtl_A_remaskBurstDataPost
#else
#define MAP___FlashCtl_A_remaskBurstDataPost                                  \
        __FlashCtl_A_remaskBurstDataPost
#endif
#ifdef ROM_FlashCtl_A_initiateSectorErase
#define MAP_FlashCtl_A_initiateSectorErase                                    \
        ROM_FlashCtl_A_initiateSectorErase
#else
#define MAP_FlashCtl_A_initiateSectorErase                                    \
        FlashCtl_A_initiateSectorErase
#endif
#ifdef ROM_FlashCtl_A_initiateMassErase
#define MAP_FlashCtl_A_initiateMassErase                                      \
        ROM_FlashCtl_A_initiateMassErase
#else
#define MAP_FlashCtl_A_initiateMassErase                                      \
        FlashCtl_A_initiateMassErase
#endif
#ifdef ROM_FlashCtl_A_isMemoryProtected
#define MAP_FlashCtl_A_isMemoryProtected                                      \
        ROM_FlashCtl_A_isMemoryProtected
#else
#define MAP_FlashCtl_A_isMemoryProtected                                      \
        FlashCtl_A_isMemoryProtected
#endif
#ifdef ROM_FlashCtl_A_getMemoryInfo
#define MAP_FlashCtl_A_getMemoryInfo                                          \
        ROM_FlashCtl_A_getMemoryInfo
#else
#define MAP_FlashCtl_A_getMemoryInfo                                          \
        FlashCtl_A_getMemoryInfo
#endif

//*****************************************************************************
//
// Macros for the LCD_F API.
//
//*****************************************************************************
#ifdef ROM_LCD_F_initModule
#define MAP_LCD_F_initModule                                                  \
        ROM_LCD_F_initModule
#else
#define MAP_LCD_F_initModule                                                  \
        LCD_F_initModule
#endif
#ifdef ROM_LCD_F_turnOn
#define MAP_LCD_F_turnOn                                                      \
        ROM_LCD_F_turnOn
#else
#define MAP_LCD_F_turnOn                                                      \
        LCD_F_turnOn
#endif
#ifdef ROM_LCD_F_turnOff
#define MAP_LCD_F_turnOff                                                     \
        ROM_LCD_F_turnOff
#else
#define MAP_LCD_F_turnOff                                                     \
        LCD_F_turnOff
#endif
#ifdef ROM_LCD_F_clearAllMemory
#define MAP_LCD_F_clearAllMemory                                              \
        ROM_LCD_F_clearAllMemory
#else
#define MAP_LCD_F_clearAllMemory                                              \
        LCD_F_clearAllMemory
#endif
#ifdef ROM_LCD_F_clearAllBlinkingMemory
#define MAP_LCD_F_clearAllBlinkingMemory                                      \
        ROM_LCD_F_clearAllBlinkingMemory
#else
#define MAP_LCD_F_clearAllBlinkingMemory                                      \
        LCD_F_clearAllBlinkingMemory
#endif
#ifdef ROM_LCD_F_selectDisplayMemory
#define MAP_LCD_F_selectDisplayMemory                                         \
        ROM_LCD_F_selectDisplayMemory
#else
#define MAP_LCD_F_selectDisplayMemory                                         \
        LCD_F_selectDisplayMemory
#endif
#ifdef ROM_LCD_F_setBlinkingControl
#define MAP_LCD_F_setBlinkingControl                                          \
        ROM_LCD_F_setBlinkingControl
#else
#define MAP_LCD_F_setBlinkingControl                                          \
        LCD_F_setBlinkingControl
#endif
#ifdef ROM_LCD_F_setAnimationControl
#define MAP_LCD_F_setAnimationControl                                         \
        ROM_LCD_F_setAnimationControl
#else
#define MAP_LCD_F_setAnimationControl                                         \
        LCD_F_setAnimationControl
#endif
#ifdef ROM_LCD_F_clearAllAnimationMemory
#define MAP_LCD_F_clearAllAnimationMemory                                     \
        ROM_LCD_F_clearAllAnimationMemory
#else
#define MAP_LCD_F_clearAllAnimationMemory                                     \
        LCD_F_clearAllAnimationMemory
#endif
#ifdef ROM_LCD_F_setPinAsLCDFunction
#define MAP_LCD_F_setPinAsLCDFunction                                         \
        ROM_LCD_F_setPinAsLCDFunction
#else
#define MAP_LCD_F_setPinAsLCDFunction                                         \
        LCD_F_setPinAsLCDFunction
#endif
#ifdef ROM_LCD_F_setPinAsPortFunction
#define MAP_LCD_F_setPinAsPortFunction                                        \
        ROM_LCD_F_setPinAsPortFunction
#else
#define MAP_LCD_F_setPinAsPortFunction                                        \
        LCD_F_setPinAsPortFunction
#endif
#ifdef ROM_LCD_F_setPinsAsLCDFunction
#define MAP_LCD_F_setPinsAsLCDFunction                                        \
        ROM_LCD_F_setPinsAsLCDFunction
#else
#define MAP_LCD_F_setPinsAsLCDFunction                                        \
        LCD_F_setPinsAsLCDFunction
#endif
#ifdef ROM_LCD_F_setPinAsCOM
#define MAP_LCD_F_setPinAsCOM                                                 \
        ROM_LCD_F_setPinAsCOM
#else
#define MAP_LCD_F_setPinAsCOM                                                 \
        LCD_F_setPinAsCOM
#endif
#ifdef ROM_LCD_F_setPinAsSEG
#define MAP_LCD_F_setPinAsSEG                                                 \
        ROM_LCD_F_setPinAsSEG
#else
#define MAP_LCD_F_setPinAsSEG                                                 \
        LCD_F_setPinAsSEG
#endif
#ifdef ROM_LCD_F_selectBias
#define MAP_LCD_F_selectBias                                                  \
        ROM_LCD_F_selectBias
#else
#define MAP_LCD_F_selectBias                                                  \
        LCD_F_selectBias
#endif
#ifdef ROM_LCD_F_setVLCDSource
#define MAP_LCD_F_setVLCDSource                                               \
        ROM_LCD_F_setVLCDSource
#else
#define MAP_LCD_F_setVLCDSource                                               \
        LCD_F_setVLCDSource
#endif
#ifdef ROM_LCD_F_clearInterrupt
#define MAP_LCD_F_clearInterrupt                                              \
        ROM_LCD_F_clearInterrupt
#else
#define MAP_LCD_F_clearInterrupt                                              \
        LCD_F_clearInterrupt
#endif
#ifdef ROM_LCD_F_getInterruptStatus
#define MAP_LCD_F_getInterruptStatus                                          \
        ROM_LCD_F_getInterruptStatus
#else
#define MAP_LCD_F_getInterruptStatus                                          \
        LCD_F_getInterruptStatus
#endif
#ifdef ROM_LCD_F_getEnabledInterruptStatus
#define MAP_LCD_F_getEnabledInterruptStatus                                   \
        ROM_LCD_F_getEnabledInterruptStatus
#else
#define MAP_LCD_F_getEnabledInterruptStatus                                   \
        LCD_F_getEnabledInterruptStatus
#endif
#ifdef ROM_LCD_F_enableInterrupt
#define MAP_LCD_F_enableInterrupt                                             \
        ROM_LCD_F_enableInterrupt
#else
#define MAP_LCD_F_enableInterrupt                                             \
        LCD_F_enableInterrupt
#endif
#ifdef ROM_LCD_F_disableInterrupt
#define MAP_LCD_F_disableInterrupt                                            \
        ROM_LCD_F_disableInterrupt
#else
#define MAP_LCD_F_disableInterrupt                                            \
        LCD_F_disableInterrupt
#endif
#ifdef ROM_LCD_F_registerInterrupt
#define MAP_LCD_F_registerInterrupt                                           \
        ROM_LCD_F_registerInterrupt
#else
#define MAP_LCD_F_registerInterrupt                                           \
        LCD_F_registerInterrupt
#endif
#ifdef ROM_LCD_F_unregisterInterrupt
#define MAP_LCD_F_unregisterInterrupt                                         \
        ROM_LCD_F_unregisterInterrupt
#else
#define MAP_LCD_F_unregisterInterrupt                                         \
        LCD_F_unregisterInterrupt
#endif

#endif // __ROM_MAP_H__
